app/views/topics/index.html.erb


            <% if !topic.favorite_users.include?(current_user) %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."topic_id" IN (?, ?)  [["topic_id", 1], ["topic_id", 2]]

                <%= image_tag 'icons/heart-black.png', class: 'topic-index-icon' %>
                <%= topic.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."topic_id" = ?  [["topic_id", 1]]

                <%= image_tag 'icons/heart-pink.png', class: 'topic-index-icon' %>
                <%= topic.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."topic_id" = ?  [["topic_id", 2]]

              <p class="topic-text">
              <% topic.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 1]]