app/controllers/comments_controller.rb

   def create
     @comment = current_user.comments.new(comment_params)
     if @comment.save
---
INSERT INTO `comments` (`user_id`, `topic_id`, `content`, `created_at`, `updated_at`) VALUES (3, 1, '２つ目', '2018-11-01 10:29:03', '2018-11-01 10:29:03')