app/controllers/favorites_controller.rb

   def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.topic_id = params[:topic_id]

     if favorite.save
---
INSERT INTO "favorites" ("user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["topic_id", 1], ["created_at", "2018-11-02 09:27:19.751657"], ["updated_at", "2018-11-02 09:27:19.751657"]]

   def  destroy
     favorite = Favorite.where(user_id: current_user.id, topic_id: params[:topic_id]).first
     if  favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."topic_id" = ? ORDER BY "favorites"."id" ASC LIMIT ?  [["user_id", 1], ["topic_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]