app/controllers/topics_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all.includes(:favorite_users)

INSERT INTO "topics" ("user_id", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["description", "写真１"], ["image", "20150918001752.png"], ["created_at", "2018-11-02 09:26:11.593106"], ["updated_at", "2018-11-02 09:26:11.593106"]]
---
  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save